SV-CarsAPI/bzt/demo_OPL-JMeter.yaml
---
execution:
- locations:
   harbor-5b8d61b8c7dc97f85d7b23c8: 1
  scenario: demo_OPL
  concurrency: 
    local: 5
    cloud: 100
  ramp-up: 1m
  hold-for: 5m
scenarios:
  demo_OPL:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/69.0.3497.100 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
      Accept-Encoding: 'gzip, deflate'
      Accept-Language: 'en-US,en;q=0.9,fr;q=0.8'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://172.20.10.2:7901/inventory/carMake/index.json'
            method: GET
            label: 'http://172.20.10.2:7901/inventory/carMake/index.json'
            think-time: 0ms
            headers: {}
          - url: 'http://172.20.10.2:7901/inventory/carMake/index.json'
            method: GET
            label: 'http://172.20.10.2:7901/inventory/carMake/index.json'
            think-time: 0ms
            headers: {}